<a href='https://i.ibb.co/TPq9FfH/Nilakantha-Singh-Deo.jpg'> <img src='https://i.ibb.co/TPq9FfH/Nilakantha-Singh-Deo.jpg' /></a>

1. CSV
2. EXCEL
3. HTML
4. SQL

### conda install 
    - sqlalchemy
    - lxml 
    - html5lib 
    - BeautifulSoup4

In [23]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th {
    border: 1px  black solid !important;
  color: black !important;
}
</style>

In [24]:
import pandas as pd

### CSV

In [25]:
# Open and read CSV files
readCsv=pd.read_csv('data/football.csv')
readCsv

,Team,Games,Win-Loss,Off Rank,Off Plays,Off Yards
0,Air Force (Mountain West),13,11-Feb,51,881,5483
1,Akron (MAC),12,0-12,130,725,2918
2,Alabama (SEC),13,11-Feb,6,842,6640
3,Appalachian St. (Sun Belt),14,13-Jan,39,969,6064
4,Arizona (Pac-12),12,04-Aug,30,873,5281
5,Arizona St. (Pac-12),13,08-May,94,842,4837
6,Arkansas (SEC),12,02-Oct,111,783,4081
7,Arkansas St. (Sun Belt),13,08-May,33,925,5711
8,Army West Point (FBS Independent),13,05-Aug,89,869,4929

In [26]:
#index=False will remove auto generated indexes by panda

readCsv.to_csv('data/football_new.csv',index=False)
df=pd.read_csv('data/football_new.csv')

### EXCEL(install using conda install xlrd)

In [27]:
pd.read_excel('data/testExcel.xlsx',sheet_name=1)

   slno      Name  Age
0     1    Antony   12
1     2      Arag   33
2     3     Raman   42
3     4  Testneil   55
4     5     Hulla   77

In [28]:
#running twice throws error if already excel exists
data={'a':[1,23],'b':[3,45]}
df=pd.DataFrame(data,index=['x','y'],columns=['column1','column2'])
df.to_excel('data/testExcel_new1.xlsx',sheet_name='NewSheet')

### HTML input

In [29]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
#It gets the tabular element
data[0]
#Get only first 7 elements
df=data[0].head(n=7)

### Reading SQL 
#### get the proper engine/library dependent upon the database

In [33]:
from sqlalchemy import create_engine
engine=create_engine('sqlite:///:memory:')
#df is the previous data from HTML
df.to_sql('myTable',engine)
sqlRead=pd.read_sql('myTable',con=engine)
sqlRead

,index,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
1,1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
2,2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
3,3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
4,4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
5,5,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017"
6,6,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017"